In [1]:
import os
os.environ["PYSPARK_PYTHON"] = "C:/Users/complere/anaconda3/envs/pyspark_env/python.exe"
os.environ["PYSPARK_DRIVER_PYTHON"] = "C:/Users/complere/anaconda3/envs/pyspark_env/python.exe"

In [2]:
import pyspark

from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("test").getOrCreate()

In [3]:
data = [("Ram", 25), ("Shyam", 30), ("Geeta", 28)]
df = spark.createDataFrame(data, ["Name", "Age"])
df.show()

+-----+---+
| Name|Age|
+-----+---+
|  Ram| 25|
|Shyam| 30|
|Geeta| 28|
+-----+---+

In [ ]:
df=pd.read_csv()
df

In [35]:
df = spark.read.csv("D:\samples_data.csv", header=True, inferSchema=True)
df.show()

+---+-------+-----+-------+---------+----------+----------+-----+
| id|   name|  age| gender|   salary| join_date|department|score|
+---+-------+-----+-------+---------+----------+----------+-----+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|    Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3|Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|  david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|    Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|  Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9| Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+-------+-----+-------+---------+----------+----------+-----+

In [ ]:
inferSchema=True means Spark will automatically detect the data types of each column instead of treating everything 
as text/string.

In [7]:
df = spark.read.csv("D:\samples_data.csv", header=True)
df.show()

+---+-------+-----+-------+---------+----------+----------+-----+
| id|   name|  age| gender|   salary| join_date|department|score|
+---+-------+-----+-------+---------+----------+----------+-----+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|    Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3|Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|  david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|    Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|  Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9| Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+-------+-----+-------+---------+----------+----------+-----+

In [8]:
df.printSchema()

root
 |-- id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- join_date: string (nullable = true)
 |-- department: string (nullable = true)
 |-- score: string (nullable = true)

In [9]:
df = spark.read.csv("D:\samples_data.csv", header=True ,inferSchema=True)
df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- age: double (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: double (nullable = true)
 |-- join_date: string (nullable = true)
 |-- department: string (nullable = true)
 |-- score: double (nullable = true)

In [ ]:
When NOT needed?
Don’t use inferSchema when	Reason
Huge files (very large datasets)	Slows reading because Spark scans data to detect types

In [ ]:
In PySpark, data types define what kind of values each column in a DataFrame can hold.​
They are part of pyspark.sql.types module and are similar to SQL or database data types.​

In [10]:
from pyspark.sql.types import StructType, StructField, IntegerType, StringType, DoubleType, DateType

schema = StructType([
    StructField("id", IntegerType(), True),
    StructField("name", StringType(), True),
    StructField("age", DoubleType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", DoubleType(), True),
    StructField("join_date", StringType(), True),   # if you want DateType, change here
    StructField("department", StringType(), True),
    StructField("score", DoubleType(), True)
])

In [11]:
df = spark.read.csv("D:\samples_data.csv", header=True ,schema=schema)
df.show()
df.printSchema()

+---+-------+-----+-------+---------+----------+----------+-----+
| id|   name|  age| gender|   salary| join_date|department|score|
+---+-------+-----+-------+---------+----------+----------+-----+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|    Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3|Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|  david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|    Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|  Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9| Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+-------+-----+-------+---------+----------+----------+-----+

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- age: double (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: double (nullable = true)
 |-- join_date: string (nullable = true)
 |-- department: string (nullable = true)
 |-- score: double (nullable = true)

In [ ]:
df['join_date']

In [13]:
df.select("join_date").show()

+----------+
| join_date|
+----------+
|2021-05-10|
|2020/03/15|
|15-07-2019|
|        IT|
|2022-13-01|
|2018-11-20|
|wrong_date|
|2021-09-01|
|2020/12/01|
|2017-05-05|
+----------+

In [11]:
#If you want join_date as Date instead of String
# it work only if your date is in spark date format 
#format is yyyy-MM-dd
StructField("join_date", DateType(), True)

StructField('join_date', DateType(), True)

In [ ]:
# but if you have mixed format you explicitely tell  csv to covert this text column in to date 
CSV stores everything as text, no datatype information:

In [14]:
from pyspark.sql.functions import to_date, col

df = df.withColumn("join_date", to_date(col("join_date"), "yyyy-MM-dd"))
df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- age: double (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: double (nullable = true)
 |-- join_date: date (nullable = true)
 |-- department: string (nullable = true)
 |-- score: double (nullable = true)

In [15]:
type(df)

pyspark.sql.dataframe.DataFrame

In [16]:
df.head(3)  # in the form of list

[Row(id=1, name='Alice', age=25.0, gender='F', salary=50000.0, join_date=datetime.date(2021, 5, 10), department='Sales', score=88.0),
 Row(id=2, name='Bob', age=30.0, gender='M', salary=62000.0, join_date=None, department='HR', score=92.0),
 Row(id=3, name='Charlie', age=None, gender='M', salary=58000.0, join_date=None, department='IT', score=79.0)]

In [ ]:
checking the datatype
select column and indexing
check describe option
adding column and droping column

In [17]:
df.columns # df.columns

['id', 'name', 'age', 'gender', 'salary', 'join_date', 'department', 'score']

In [18]:
df.select('name') # df['name']

DataFrame[name: string]

In [19]:
df.select('name').show()

+-------+
|   name|
+-------+
|  Alice|
|    Bob|
|Charlie|
|  david|
|    Eve|
|    Eve|
|  Frank|
|   NULL|
| Grace |
|  Henry|
+-------+

In [20]:
df.select(['name','age']) # df[['name','age']]

DataFrame[name: string, age: double]

In [5]:
df.select(['name','age']).show()

+-------+-----+
|   name|  age|
+-------+-----+
|  Alice| 25.0|
|    Bob| 30.0|
|Charlie| NULL|
|  david| 45.0|
|    Eve| -3.0|
|    Eve|200.0|
|  Frank| 33.0|
|   NULL| 29.0|
| Grace | NULL|
|  Henry| 41.0|
+-------+-----+

In [ ]:
# slicing will not work

In [6]:
# check the datatype 
df.dtypes # df.dtypes

[('id', 'int'),
 ('name', 'string'),
 ('age', 'double'),
 ('gender', 'string'),
 ('salary', 'double'),
 ('join_date', 'string'),
 ('department', 'string'),
 ('score', 'double')]

In [7]:
df.describe() # df.describe()

DataFrame[summary: string, id: string, name: string, age: string, gender: string, salary: string, join_date: string, department: string, score: string]

In [8]:
df.describe().show() # min,max,stddev,mean,count

+-------+-----------------+-------+------------------+------+-----------------+----------+----------+-----------------+
|summary|               id|   name|               age|gender|           salary| join_date|department|            score|
+-------+-----------------+-------+------------------+------+-----------------+----------+----------+-----------------+
|  count|               10|      9|                 8|     9|                8|        10|         8|                9|
|   mean|              5.4|   NULL|              50.0|  NULL|         174500.0|      NULL|      NULL|            106.0|
| stddev|3.025814858109391|   NULL|62.301112120319104|  NULL|333639.6687617175|      NULL|      NULL|73.25298628724974|
|    min|                1| Grace |              -3.0|     F|          49000.0|15-07-2019|   Finance|             65.0|
|    max|               10|  david|             200.0|  male|        1000000.0|wrong_date|   finance|            300.0|
+-------+-----------------+-------+------------------+------+-----------------+----------+----------+-----------------+

In [17]:
# adding the column
df.withColumn('age after two year',df['age']+2)

DataFrame[id: int, name: string, age: double, gender: string, salary: double, join_date: date, department: string, score: double, age after two year: double]

In [ ]:
# df['new']=df['age']*2

In [18]:
df.withColumn('age after two year',df['age']+2).show()

+---+-------+-----+-------+---------+----------+----------+-----+------------------+
| id|   name|  age| gender|   salary| join_date|department|score|age after two year|
+---+-------+-----+-------+---------+----------+----------+-----+------------------+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|              27.0|
|  2|    Bob| 30.0|      M|  62000.0|      NULL|        HR| 92.0|              32.0|
|  3|Charlie| NULL|      M|  58000.0|      NULL|        IT| 79.0|              NULL|
|  4|  david| 45.0|   male|     NULL|      NULL|      NULL| NULL|              47.0|
|  5|    Eve| -3.0|      F|  72000.0|      NULL|      NULL| 65.0|              -1.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|             202.0|
|  7|  Frank| 33.0|      M|  54000.0|      NULL|   finance| 73.0|              35.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|              31.0|
|  9| Grace | NULL|      F|  49000.0|      NULL|     SALES| 90.0|              NULL|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|              43.0|
+---+-------+-----+-------+---------+----------+----------+-----+------------------+

In [19]:
df.show() # inplace =True, df=df

+---+-------+-----+-------+---------+----------+----------+-----+
| id|   name|  age| gender|   salary| join_date|department|score|
+---+-------+-----+-------+---------+----------+----------+-----+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|    Bob| 30.0|      M|  62000.0|      NULL|        HR| 92.0|
|  3|Charlie| NULL|      M|  58000.0|      NULL|        IT| 79.0|
|  4|  david| 45.0|   male|     NULL|      NULL|      NULL| NULL|
|  5|    Eve| -3.0|      F|  72000.0|      NULL|      NULL| 65.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|  Frank| 33.0|      M|  54000.0|      NULL|   finance| 73.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9| Grace | NULL|      F|  49000.0|      NULL|     SALES| 90.0|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+-------+-----+-------+---------+----------+----------+-----+

In [23]:
df=df.withColumn('age after two year',df['age']+2) # no inplace method

In [24]:
df.show()

+---+-------+-----+-------+---------+----------+----------+-----+------------------+
| id|   name|  age| gender|   salary| join_date|department|score|age after two year|
+---+-------+-----+-------+---------+----------+----------+-----+------------------+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|              27.0|
|  2|    Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|              32.0|
|  3|Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|              NULL|
|  4|  david| 45.0|   male|     NULL|        IT|      NULL| NULL|              47.0|
|  5|    Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|              -1.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|             202.0|
|  7|  Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|              35.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|              31.0|
|  9| Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|              NULL|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|              43.0|
+---+-------+-----+-------+---------+----------+----------+-----+------------------+

In [25]:
# drop the column
df=df.drop('age after two year')   #df.drop

In [26]:
df.show()

+---+-------+-----+-------+---------+----------+----------+-----+
| id|   name|  age| gender|   salary| join_date|department|score|
+---+-------+-----+-------+---------+----------+----------+-----+
|  1|  Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|    Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3|Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|  david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|    Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|    Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|  Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|   NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9| Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|  Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+-------+-----+-------+---------+----------+----------+-----+

## rename the column

#df.withColumnRenamed('old','new')
df.withColumnRenamed('name','emp_name')

In [33]:
df=df.withColumnRenamed('name','emp_name')   # df.rename({

In [ ]:
new_names = {
    "name": "emp_name",
    "age": "emp_age"
}

In [ ]:
for old, new in new_names.items():   
    df = df.withColumnRenamed(old, new)

In [38]:
new_names.items()

dict_items([('name', 'emp_name'), ('age', 'emp_age')])

In [39]:
df.show()

+---+--------+-------+-------+---------+----------+----------+-----+
| id|emp_name|emp_age| gender|   salary| join_date|department|score|
+---+--------+-------+-------+---------+----------+----------+-----+
|  1|   Alice|   25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|   30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie|   NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david|   45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|   -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|  200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank|   33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL|   29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace |   NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry|   41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-------+-------+---------+----------+----------+-----+

In [ ]:
# other option 
df = df.withColumnRenamed("name", "emp_name") \
       .withColumnRenamed("age", "emp_age")

# handling missing value

droping column # df.drop("colname')
droping row
droping with more  parameter
handlinh missing value by mean,median,mode

In [ ]:
Why Handle Nulls & Duplicates?​
Real-world data often contains missing values (nulls) and duplicate records.​
Nulls can lead to errors or wrong analysis results.​
PySpark provides functions to clean data efficiently.​

In [ ]:
Handling Nulls – Functions​
dropna() → Remove rows with null values.​

fillna() → Replace null values with a default value.​

na.replace() → Replace specific nulls with values.

In [ ]:
dropna()- Remove rows with null values​
Removes rows that contain null (missing) values.​
Can be customized with options:​

In [36]:
df.show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [37]:
df.dropna().show()

+---+--------+----+------+-------+----------+----------+-----+
| id|emp_name| age|gender| salary| join_date|department|score|
+---+--------+----+------+-------+----------+----------+-----+
|  1|   Alice|25.0|     F|50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|30.0|     M|62000.0|2020/03/15|        HR| 92.0|
|  7|   Frank|33.0|     M|54000.0|wrong_date|   finance| 73.0|
+---+--------+----+------+-------+----------+----------+-----+

In [39]:
df.dropna(how="any", thresh=None, subset=None).show() # same as previous

+---+--------+----+------+-------+----------+----------+-----+
| id|emp_name| age|gender| salary| join_date|department|score|
+---+--------+----+------+-------+----------+----------+-----+
|  1|   Alice|25.0|     F|50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|30.0|     M|62000.0|2020/03/15|        HR| 92.0|
|  7|   Frank|33.0|     M|54000.0|wrong_date|   finance| 73.0|
+---+--------+----+------+-------+----------+----------+-----+

In [38]:
#how="any" → drop row if any column has null (default).​

#how="all" → drop row if all columns are null.​

#thresh=n → keep row if it has at least n non-null values.​

#subset=["col1","col2"] → apply only to selected columns.

+---+--------+----+------+-------+----------+----------+-----+
| id|emp_name| age|gender| salary| join_date|department|score|
+---+--------+----+------+-------+----------+----------+-----+
|  1|   Alice|25.0|     F|50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|30.0|     M|62000.0|2020/03/15|        HR| 92.0|
|  7|   Frank|33.0|     M|54000.0|wrong_date|   finance| 73.0|
+---+--------+----+------+-------+----------+----------+-----+

In [40]:
df.dropna(how="all").show()       # drop only rows fully null​

+---+--------+-------+-------+---------+----------+----------+-----+
| id|emp_name|emp_age| gender|   salary| join_date|department|score|
+---+--------+-------+-------+---------+----------+----------+-----+
|  1|   Alice|   25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|   30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie|   NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david|   45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|   -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|  200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank|   33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL|   29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace |   NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry|   41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-------+-------+---------+----------+----------+-----+

In [41]:
df.show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [41]:
df.dropna(thresh=1).show()       # keep rows with at least 7 non-null 
# id 4 is deleted     # atleast 7 non null values should be there

+---+--------+-------+-------+---------+----------+----------+-----+
| id|emp_name|emp_age| gender|   salary| join_date|department|score|
+---+--------+-------+-------+---------+----------+----------+-----+
|  1|   Alice|   25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|   30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie|   NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david|   45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|   -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|  200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank|   33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL|   29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace |   NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry|   41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-------+-------+---------+----------+----------+-----+

In [43]:
df.dropna(subset=["emp_age"]).show()  # drop rows where Age is null

+---+--------+-------+-------+---------+----------+----------+-----+
| id|emp_name|emp_age| gender|   salary| join_date|department|score|
+---+--------+-------+-------+---------+----------+----------+-----+
|  1|   Alice|   25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|   30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  4|   david|   45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|   -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|  200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank|   33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL|   29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
| 10|   Henry|   41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-------+-------+---------+----------+----------+-----+

In [ ]:
fillna()- Replace null values with a default
Fills null values with constants (number, string, dict).​
Useful when you don’t want to remove data but impute missing values.​

In [ ]:
#df.fillna(value, subset=None)
value can be:​

Single value → applies to all columns.​
Dict → column-wise replacement.​

​subset → choose specific columns to apply. work with single value

In [44]:
df.fillna(0).show()                          # fill all nulls with 0

+---+--------+-------+-------+---------+----------+----------+-----+
| id|emp_name|emp_age| gender|   salary| join_date|department|score|
+---+--------+-------+-------+---------+----------+----------+-----+
|  1|   Alice|   25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|   30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie|    0.0|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david|   45.0|   male|      0.0|        IT|      NULL|  0.0|
|  5|     Eve|   -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|  200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank|   33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL|   29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace |    0.0|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry|   41.0|Unknown|      0.0|2017-05-05|        IT| 82.0|
+---+--------+-------+-------+---------+----------+----------+-----+

In [48]:
df.fillna("Unknown", subset=["emp_name","age"]).show()  # only for Name

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [49]:
df.fillna({"age": 18, "emp_name": "N/A"}).show() # different defaults per column​

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| 18.0|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|     N/A| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | 18.0|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [ ]:
 na.replace()- Replace specific values​
More flexible than fillna() because it can replace any value (not just null).​

Often used for data standardization.​

In [ ]:
df.na.replace(to_replace, value, subset=None)​
to_replace → list or dict of values to replace.​['N/A,NULL,unknown']

value → replacement value(s).​

subset → apply to selected columns.​

In [50]:
df.na.replace("Alice", "Alicia").show()  # replace Alice with Alicia

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|  Alicia| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [55]:
df.na.replace(["Henry", "Bob"], ["Unknown", "Robert"]).show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|  Robert| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10| Unknown| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [56]:
df.na.replace({"Alice":"Alicia", "Bob":"Bobby"}).show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|  Alicia| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|   Bobby| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8|    NULL| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [58]:
df = df.na.fill("Unknown", subset=["emp_name"]) #other option 
df.show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

# Handling Duplicates

In [ ]:
distinct() → Returns unique rows across all columns.​

dropDuplicates(["col1","col2"]) → Removes duplicates based on specific columns.​

In [59]:
df_dist = df.distinct() #Removes duplicate rows from the DataFrame.​
df_dist.show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [61]:
#dropDuplicates() 
df = df.dropDuplicates(["emp_name"])
df.show()
# Eve is deleted

+---+--------+----+-------+-------+----------+----------+-----+
| id|emp_name| age| gender| salary| join_date|department|score|
+---+--------+----+-------+-------+----------+----------+-----+
|  9|  Grace |NULL|      F|49000.0|2020/12/01|     SALES| 90.0|
|  1|   Alice|25.0|      F|50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob|30.0|      M|62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie|NULL|      M|58000.0|15-07-2019|        IT| 79.0|
|  5|     Eve|-3.0|      F|72000.0|2022-13-01|      NULL| 65.0|
|  7|   Frank|33.0|      M|54000.0|wrong_date|   finance| 73.0|
| 10|   Henry|41.0|Unknown|   NULL|2017-05-05|        IT| 82.0|
|  8| Unknown|29.0| FEMALE|51000.0|2021-09-01|     Sales| 85.0|
|  4|   david|45.0|   male|   NULL|        IT|      NULL| NULL|
+---+--------+----+-------+-------+----------+----------+-----+

# filtering

In [ ]:
filter() or where()- Filtering DataFrames​
filter() or where() method is used to select rows based on a specified condition.​

Both filter() and where() work the same way.​

In [62]:
df.filter(df.age > 25).show()     # df[df[emp]>25]

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [65]:
df.where(df.age == 25).show()

+---+--------+----+------+-------+----------+----------+-----+
| id|emp_name| age|gender| salary| join_date|department|score|
+---+--------+----+------+-------+----------+----------+-----+
|  1|   Alice|25.0|     F|50000.0|2021-05-10|     Sales| 88.0|
+---+--------+----+------+-------+----------+----------+-----+

In [ ]:
Sort() or orderBy()- Sorting Data​
sort() or orderBy() Sorts rows by one or more columns.​

Default = ascending; use .desc() for descending.​

In [66]:
df.orderBy("age").show()      # df.sort_value(

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [67]:
df.orderBy(df.age.desc()).show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [68]:
df.sort("age").show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [70]:
df.sort(df.age.desc()).show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
+---+--------+-----+-------+---------+----------+----------+-----+

In [76]:
df.show()

+---+--------+-----+-------+---------+----------+----------+-----+
| id|emp_name|  age| gender|   salary| join_date|department|score|
+---+--------+-----+-------+---------+----------+----------+-----+
|  1|   Alice| 25.0|      F|  50000.0|2021-05-10|     Sales| 88.0|
|  2|     Bob| 30.0|      M|  62000.0|2020/03/15|        HR| 92.0|
|  3| Charlie| NULL|      M|  58000.0|15-07-2019|        IT| 79.0|
|  4|   david| 45.0|   male|     NULL|        IT|      NULL| NULL|
|  5|     Eve| -3.0|      F|  72000.0|2022-13-01|      NULL| 65.0|
|  5|     Eve|200.0|   NULL|1000000.0|2018-11-20|   Finance|300.0|
|  7|   Frank| 33.0|      M|  54000.0|wrong_date|   finance| 73.0|
|  8| Unknown| 29.0| FEMALE|  51000.0|2021-09-01|     Sales| 85.0|
|  9|  Grace | NULL|      F|  49000.0|2020/12/01|     SALES| 90.0|
| 10|   Henry| 41.0|Unknown|     NULL|2017-05-05|        IT| 82.0|
+---+--------+-----+-------+---------+----------+----------+-----+